import time

tasks = {
    "розібрати горище": "готово",
    "залити стяжку": "готово",
    "розібрати дах": "готово",
    "мурувати 2-ий поверх": "готово",
    "каркас даху": "готово",
    "накрити плівкою": "готово",
    "накрити хату": "готово",
    "утеплення стель": "готово",
    "чорнова стяжка в кухні і коридорі": "готово",
    "вихід на 2-ий поверх": "готово",
    "котельня": "готово",
    "підлога на стриху": "готово",
    "електрика зверху": "готово",
    "електрика знизу": "готово",
    "штукатурка": "готово",
    "каналізація із кухні": "готово",
    "приєднати нову каналізацію до старої": "готово",
    "зміна опалення": "готово",
    "фасад": "готово",
    "відеонагляд і сигналізація": "готово",
    "тепла стяжка": "готово",
    "мурувати коридор і комору": "готово",
    "гіпсокартон на стелі": "готово",
    "чорнова підлога в кімнатах": "готово",
    "плитка в кухні": "готово",
    "двері в кухні": "готово",
    "ремонт в кухні": "готово",
    "двері в кімнатах": "готово",
    "шпаклівка стель і стін зверху": "готово",
    "стіни і стеля в коморі": "готово",
    "плитка в коморі": "готово",
    "плитка на підлозі зверху": "готово",
    "плитка на стінах ванної": "готово",
    "плитка на балконі": "готово",
    "вагонка на балконі": "",
    "малювати стіни зверху": "готово",
    "шпаклівка стель і стін знизу": "готово",
    "малювати стіни знизу": "готово",
    "плитка на підлозі знизу": "готово",
    "наклейки на стіни внизу і шпалери зверху": "",
    "декор знизу і зверху": "",
    "сходинки і перила": "",
    "двері котельні": "",
    "розетки зверху": "готово",
    "розетки знизу": "готово",
    "сантехніка зверху": "",
    "утеплення фундаменту": "",
}
yes_answer = ("Так", "так", "Т", "т", "Y", "y")

print("")
print("Привіт слимаки :)")
print("\n")
time.sleep(2)

print(f"Кількість задач - ", len(tasks))

answer = (input("Показати список задач? Введіть 'Так' або 'Ні' - "))

if answer in yes_answer:
    print("------------")
    print("")
    print(f"Список, що треба зробити - ")

    for key, value in tasks.items():
        if value:
            print(f" - {key} - {value}")
        else:
            print(f" - {key} - .......")
    print("")
    print("------------")

# while True:
#     tasks_answer = input("Додати ще завдання? Введіть 'Так' або 'Ні' - ")
#     if tasks_answer in yes_answer:
#         new_task = input("Введіть завдання - ")
#         tasks[new_task] = ""
#     else:
#         break


task_key_value = 100/len(tasks)

done_tasks, need_to_be_done = [], []

for key, value in tasks.items():
    if value == "готово":
        done_tasks.append(key)
    else:
        need_to_be_done.append(key)


print(f"Готово задач - {len(done_tasks)} із {len(tasks)}")
print(f"У відсотках - {round(task_key_value*len(done_tasks), 2)}%")
print("\n")

answer = input("Показати не завершені задачі? - ")
if answer in yes_answer:
    print("------------")
    print("")
    print("Ще зробити задач - ", len(need_to_be_done))
    print("")

    for key, value in tasks.items():
        if not value:
            print(f" - {key}")


    print("")
    print("------------")
print("\n")

time.sleep(1)
print("Бувайте, слимаки :)")
